In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
pd.set_option("display.max_columns" , None)
pd.set_option("display.max_rows" , None)

# #Read train dataset

In [2]:
train = pd.read_excel(r"C:\Users\home\Desktop\Skillenza\Stage3\Problem 2\train_data.xlsx")

In [3]:
train.head()

   Book_Stall  Genre  Week_Date  Sales_in_a_week  Holiday
0           1      1 2010-02-05         24924.50    False
1           1      1 2010-02-12         46039.49     True
2           1      1 2010-02-19         41595.55    False
3           1      1 2010-02-26         19403.54    False
4           1      1 2010-03-05         21827.90    False

In [4]:
train.shape

(293704, 5)

## #Checking nulls of train data

In [5]:
train.isnull().sum()  #no nulls

Book_Stall         0
Genre              0
Week_Date          0
Sales_in_a_week    0
Holiday            0
dtype: int64

## #Converting non numeric columns into numeric

In [6]:
train.Holiday.value_counts()

False    273013
True      20691
Name: Holiday, dtype: int64

In [7]:
train.Holiday.replace({ False : 0 , True : 1} , inplace = True)

In [8]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293704 entries, 0 to 293703
Data columns (total 5 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Book_Stall       293704 non-null  int64
 1   Genre            293704 non-null  int64
 2   Week_Date        293704 non-null  datetime64[ns]
 3   Sales_in_a_week  293704 non-null  float64
 4   Holiday          293704 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 11.2 MB

In [9]:
attr = pd.read_excel(r"C:\Users\home\Desktop\Skillenza\Stage3\Problem 2\More-Attributes.xlsx")

In [10]:
attr.head()

   ID Date_in_a_week  Campaign 1  Campaign 2  Consumer Price Index  Holiday
0   1     2010-02-05         NaN         NaN            211.096358    False
1   1     2010-02-12         NaN         NaN            211.242170     True
2   1     2010-02-19         NaN         NaN            211.289143    False
3   1     2010-02-26         NaN         NaN            211.319643    False
4   1     2010-03-05         NaN         NaN            211.350143    False

In [11]:
attr.shape

(5460, 6)

In [12]:
train.shape

(293704, 5)

## #Reading the master file

In [13]:
master = pd.read_excel(r"C:\Users\home\Desktop\Skillenza\Stage3\Problem 2\Master.xlsx")

In [14]:
master.shape

(30, 2)

In [15]:
master.head()

   Stall    Size
0      1  151315
1      2  202307
2      3   37392
3      4  205863
4      5   34875

In [16]:
master.isnull().sum()

Stall    0
Size     0
dtype: int64

In [17]:
master.rename(columns = {"Stall" :"Book_Stall"} ,inplace = True)

In [18]:
master.head(3)

   Book_Stall    Size
0           1  151315
1           2  202307
2           3   37392

## #Separating Day,Month and year from Week_Date column

In [19]:
train["Day"] = train.Week_Date.dt.day
train["Month"] = train.Week_Date.dt.month
train["Year"] = train.Week_Date.dt.year

In [20]:
train.head()

   Book_Stall  Genre  Week_Date  Sales_in_a_week  Holiday  Day  Month  Year
0           1      1 2010-02-05         24924.50        0    5      2  2010
1           1      1 2010-02-12         46039.49        1   12      2  2010
2           1      1 2010-02-19         41595.55        0   19      2  2010
3           1      1 2010-02-26         19403.54        0   26      2  2010
4           1      1 2010-03-05         21827.90        0    5      3  2010

In [21]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293704 entries, 0 to 293703
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Book_Stall       293704 non-null  int64
 1   Genre            293704 non-null  int64
 2   Week_Date        293704 non-null  datetime64[ns]
 3   Sales_in_a_week  293704 non-null  float64
 4   Holiday          293704 non-null  int64
 5   Day              293704 non-null  int64
 6   Month            293704 non-null  int64
 7   Year             293704 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(6)
memory usage: 17.9 MB

### #Dropping Week_Date column

In [22]:
train_new = train.drop( ["Week_Date" ] , axis=1)

In [23]:
train_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293704 entries, 0 to 293703
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Book_Stall       293704 non-null  int64
 1   Genre            293704 non-null  int64
 2   Sales_in_a_week  293704 non-null  float64
 3   Holiday          293704 non-null  int64
 4   Day              293704 non-null  int64
 5   Month            293704 non-null  int64
 6   Year             293704 non-null  int64
dtypes: float64(1), int64(6)
memory usage: 15.7 MB

# #Merging master and train data

In [24]:
train1 = pd.merge(train_new , master)

In [25]:
train1.head()

   Book_Stall  Genre  Sales_in_a_week  Holiday  Day  Month  Year    Size
0           1      1         24924.50        0    5      2  2010  151315
1           1      1         46039.49        1   12      2  2010  151315
2           1      1         41595.55        0   19      2  2010  151315
3           1      1         19403.54        0   26      2  2010  151315
4           1      1         21827.90        0    5      3  2010  151315

# #Splitting X and Y

In [34]:
X = train1.iloc[:, train1.columns!="Sales_in_a_week"]
Y = train1.iloc[: ,train1.columns=="Sales_in_a_week" ]

In [35]:
X.head()

   Book_Stall  Genre  Holiday  Day  Month  Year    Size
0           1      1        0    5      2  2010  151315
1           1      1        1   12      2  2010  151315
2           1      1        0   19      2  2010  151315
3           1      1        0   26      2  2010  151315
4           1      1        0    5      3  2010  151315

In [36]:
Y.head()

   Sales_in_a_week
0         24924.50
1         46039.49
2         41595.55
3         19403.54
4         21827.90

# #Train-Test split

In [37]:
import sklearn

In [38]:
from sklearn.model_selection import train_test_split

In [39]:
X_train , X_test , Y_train ,Y_test = train_test_split( X , Y , test_size = .2 )

# #RandomForest Regressor model

In [40]:
from sklearn.ensemble import RandomForestRegressor

In [41]:
 # create regressor object 
reg = RandomForestRegressor()

In [42]:
reg.fit(X_train , Y_train )

C:\Users\home\anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\Users\home\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=10,
                      n_jobs=None, oob_score=False, random_state=None,
                      verbose=0, warm_start=False)

## #Prediction

In [43]:
pred_value= reg.predict(X_test)

In [44]:
pred_value

array([15073.949, 16068.399, 20341.079, ...,   146.244, 42960.66 ,
        8245.   ])

# #R-sqaure

In [45]:
reg.score(X_train ,Y_train)

0.9955504560102778

In [46]:
from sklearn import metrics

In [47]:
MAE = metrics.mean_absolute_error(Y_test , pred_value)
MAE

1510.956418753511

# #Read the test file

In [48]:
test = pd.read_excel(r"C:\Users\home\Desktop\Skillenza\Stage3\Problem 2\test_sales.xlsx")

In [49]:
test.head()

   ID  Book_Stall  Genre  Week_Date  Holiday
0   1           1      1 2012-11-02    False
1   2           1      1 2012-11-09    False
2   3           1      1 2012-11-16    False
3   4           1      1 2012-11-23     True
4   5           1      1 2012-11-30    False

## #Checking nulls

In [50]:
test.isnull().sum()

ID            0
Book_Stall    0
Genre         0
Week_Date     0
Holiday       0
dtype: int64

## #Converting non numeric into numeric

In [51]:
test.Holiday.replace({ False : 0 , True : 1} , inplace = True)

## #Separating Day , Month and year

In [52]:
test["Day"] = test.Week_Date.dt.day
test["Month"] = test.Week_Date.dt.month
test["Year"] = test.Week_Date.dt.year

In [53]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80021 entries, 0 to 80020
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          80021 non-null  int64
 1   Book_Stall  80021 non-null  int64
 2   Genre       80021 non-null  int64
 3   Week_Date   80021 non-null  datetime64[ns]
 4   Holiday     80021 non-null  int64
 5   Day         80021 non-null  int64
 6   Month       80021 non-null  int64
 7   Year        80021 non-null  int64
dtypes: datetime64[ns](1), int64(7)
memory usage: 4.9 MB

## #Dropping unnecessary columns

In [54]:
test_new =test.drop(["ID" , "Week_Date"] ,axis = 1)

In [55]:
test_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80021 entries, 0 to 80020
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Book_Stall  80021 non-null  int64
 1   Genre       80021 non-null  int64
 2   Holiday     80021 non-null  int64
 3   Day         80021 non-null  int64
 4   Month       80021 non-null  int64
 5   Year        80021 non-null  int64
dtypes: int64(6)
memory usage: 3.7 MB

## #Splitting X and Y

In [58]:
X1 = train1.iloc[:,[0,1,3,4,5,6]]
Y1 = Y

# #Model fitting

In [59]:
reg.fit(X1 , Y1 )

C:\Users\home\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=10,
                      n_jobs=None, oob_score=False, random_state=None,
                      verbose=0, warm_start=False)

## #Prediction

In [60]:
pred_value1 = reg.predict(test_new)

In [61]:
reg.score(X1,Y1)

0.9949240844633486

# #Creating a dataframe with ID and prediction values

In [62]:
df = pd.concat( [test.ID , pd.Series(pred_value1)]  ,  axis = 1)

In [63]:
df.head()

   ID          0
0   1  36101.627
1   2  19257.152
2   3  18991.511
3   4  20943.132
4   5  42707.486

## #Renaming the column

In [64]:
df.rename(columns = {0 : "Sales_in_a_week"} , inplace = True)

In [65]:
df.head()

   ID  Sales_in_a_week
0   1        36101.627
1   2        19257.152
2   3        18991.511
3   4        20943.132
4   5        42707.486

# #Final output to csv file

In [66]:
df.to_csv(r"D:\Stage3_P2.csv" , index = False)